module.exports = {
  config: {
    name: "war",
    aliases: ["chud"],
    version: "1.0",
    author: "nexo_here",
    role: 2,
    category: "admin",
    guide: {
      vi: "Not Available",
      en: "chud @(mention)"
    } 
  },

  onStart: async function ({ api, event, userData, args }) {
      var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("Need to tag 1 friend whome you want to scold with bad words", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = []; 
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
setTimeout(() => {a({body: "কিরে মাদারচোত সাজ্জাদ এর চুদন খাওয়ায় জন্য রেডি তো?" + "লে চুদা খা মাঙ্গের বেটা 😂😂" + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "মাঘি চুদা কুত্তার বাচ্চা কার লগে পঙ্গা নিতে আসছিস 🤬🤬🤬" + " Tera Ma ki Chud Bokada, redni ka olad 💥" + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: " চুদে গুহা ফাঁক করে দিব খানকীর পোলা 🤤" + " জারজ সন্তান- তোর ময়ের পচাঁ মাসিক খাস তুই!🤮😹" + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: " মাদারচোত বোকাচোদা খানকীর পোলা " + " তোমার মায়ের কালা হক থু থু থু 😙💦" + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: " বেসসা মাগির চোদা কুত্তা চোদা" + " বাস্টার্ড এর ছেলে, চুদে কিডনি লক করে দিবো!- 🖕🥱" + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: " ছাগল চুদা গরু চুদা মাঙ্গের বেটা লোকজন দেখে লাগতে আসিস কুত্তার বাচ্চা 🤬" + " হাত মারা মাগির ছেলে, ছিহ 😾🖕 " + name, mentions: arraytag})}, 14000);
setTimeout(() => {a({body: " তোর আব্বুকে ভুলে গেলি মাদারচোত 😂" + " তোর আব্বু Rafi Elan Sazzad - Mind it" + name, mentions: arraytag})}, 16000);
setTimeout(() => {a({body: " তোকে কনডম ছাড়া চুদী মঙ্গের বেটা 🖕🏿" + " তোমার মা'কে রাস্তায় লেংটা করে বেধে রাখবো- পাবলিক ফ্রি তে চুদবে! 💋" + name, mentions: arraytag})}, 18000);
setTimeout(() => {a({body: " আমার ধন চুষ তাইলে থামবো 😂" + " কুত্তার চোদা খেয়ে জন্ম তোর 👾" + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: " তোরে কুত্তা দিয়ে চোদাই 😍" + " আব্বু ডাক মাফ করে দিবো 🥱" + name, mentions: arraytag})}, 22000);
setTimeout(() => {a({body: " মাঘীর মাং চাটিস বোকাচোদার বাচ্চা তোকে কন্ডম ছাড়া উল্টা করে চুদি 🤬" + " তোর মায়ের ভোদা কেটে বিক্রি করে দিবো- 😎👍" + name, mentions: arraytag})}, 2400);
setTimeout(() => {a({body: " এখনো সময় আছে মাফ চা 🤣🤣" + " পা ধর মাফ করে দিবো, খাংকির ছেলে 🦵💨" + name, mentions: arraytag})}, 26000);
setTimeout(() => {a({body: " তোর বোন এর ভোদায় যে গন্ধ 🤧 😍??" + " 😡 পতিতালয় এ জন্ম নিয়ে - সাজ্জাদ এর সাথে লাগতে আসছিস? 😹🤡" + name, mentions: arraytag})}, 28000);
setTimeout(() => {a({body: " তোকে চুদী 🥰" + " শোন শোন শোনা মনি তোর মায়ের মাং এ দিবো আমার ধনের পানি 💦" + name, mentions: arraytag})}, 30000);
setTimeout(() => {a({body: " মাদারচোত 🥰" + " বকাচোদার বান্ডিল 🤣 চুদে গাড় ফাটায় দিবো " + name, mentions: arraytag})}, 32000);
setTimeout(() => {a({body: " আব্বা কে ভুলিস না 🤬" + " Mind it Your father - Rafi elan Sazzad" + name, mentions: arraytag})}, 65000);
setTimeout(() => {a({body: " আজকের চুদন আজীবন মনে রাখিস বোকাচোদা 🤣🤣🤣" + " ছয় তালা থেকে লাফ দিয়ে তোর মায়ের মাং এ ঢুকে যাবো 🫦👣" + name, mentions: arraytag})}, 34000);
setTimeout(() => {a({body: "মাঘা 🥰" + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a({body: " আয় আমার হোল টা চুষে দে 🥵🥵" + " তোর মতো জঘন্য বোকাচোদা আগে দেখি নি 🤖👠 " + name, mentions: arraytag})}, 38000);
setTimeout(() => {a({body: " বাপ কে ভুলিস না বোকাচোদার বাচ্চা 🤬🤬🤬🤬🤬" + " তোর মায়ের ভোদা নিলাম 📣" + name, mentions: arraytag})}, 40000);
setTimeout(() => {a({body: " হোল কাটে নিবো 🤬🤬🤬🤬🤬🤬" + " চুদা খেয়ে প্যান্ট এ মুতে দিলি নাকি? 🗿" + name, mentions: arraytag})}, 44000);
setTimeout(() => {a({body: " তোমার গুষ্টি চুদী ব্রো 😞🖕🏿" + " তোর কচি বোনের ভোদায় উম্মাহ 🌪️💋" + name, mentions: arraytag})}, 460000);
setTimeout(() => {a({body: "🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿🖕🏿" + " "  " + name,mentionss: arraytag})}, 48000);
setTimeout(() => {a({body: " মাঘীর ছেলে তোর মাকে চুদী 🖕🏽🖕🏽🖕🏽 " + " " + name, mentions: arraytag})} , 50000);
setTimeout(() => {a({body: " আজকে তোকে প্যান্ট না খুলেই চুদবো 🤬 তোর মাকে একটু আগেই চুঁদে আসলাম 😂" + " Fuck You রেন্ডির ছেলে 💔 " + name, mentions: arraytag})} , 52000);
setTimeout(() => {a({body: "বোকাচোদার বাচ্চা 😂" + " তোর মায়ের ভোদায় আগুন লাগায় দিবো 💥🥱" + name,mentionss: arraytag})} , 56000);
setTimeout(() => {a({body: " মাদারচোত বোকাচোদা খানকীর ছেলে 🤬" + " তোর মায়ের ভোদা চোদার বাজারে ফ্রি -যা চুদে আয় " + name, mentions: arraytag})} , 58000);
setTimeout(() => {a({body: " প্যান্ট ভিজে নাই 🤣🤣🤣🤣🤣🤣🤣???" + " তোর মাকে চোদার৷ জন্য, কুত্তা ও আসে না 😞🤣" + name, mentions: arraytag})} , 60000);
setTimeout(() => {a({body: " আরো চুদন খাইতে চাচ্ছিস ???? " + " কনডম ফেটে জন্ম নিছিস, খাংকির ছেলে 😹💨 " + name, mentions: arraytag})} , 62000);
setTimeout(() => {a({body: " আয় মাদারচোত আমার ধণ টা চুষে যা 🤬"+ " টাকার বিনিময়ে তোর মাকে চুদি  365 দিন 😎" + name, mentions: arraytag})} , 64000);
setTimeout(() => {a({body: " তোকে ডগি স্টাইল e চুদী 😋😋" + " তোর মাকে নিয়ে পর্নোগ্রাফি বানাবো 🗿🌪️ " + name, mentions: arraytag})} , 66000);
setTimeout(() => {a({body: " তোর আব্বাকে ভুললে আরেকবার এমন চুদন চুদবো মোর যাবি মঙ্গের বেটা 😂😂😂" + " " + name, mentions: arraytag})} , 68000);
setTimeout(() => {a({body: " আজকের চুদন আজীবন মনে রাখবি 🤣🤣🤣" + " তোর মা পতিতালয় এর খাংকি, আর তুই ম্যানেজার 🐸" + name, mentions: arraytag})} , 70000);
setTimeout(() => {a({body: " আয় আমার ধোন টা চুষে যা মঙ্গের পুত 🤬🤬🤬🤬" + " চুদানি ভুদানি মাগির পোলা, মুরগি শুওরের বাচ্চা 😡🖕" + name, mentions: arraytag})} , 72000);
setTimeout(() => {a({body: " তোরে মুততে মুততে চুদী 🤣🤣" + " মাসিক খাবি ফ্রি তে খাওয়াবো - 🤘💋" + name, mentions: arraytag})} , 74000);
setTimeout(() => {a({body: " চুঁদে পাউরুটি বানায় তোর হোগায় ভরে দিব মাঙ্গের বেতা চিনিস আমারে???" + " আব্লামি করার কারনে তোর মারে চুদি 🫶" + name, mentions: arraytag})} , 76000);
setTimeout(() => {a({body: " খানকীর পোলা তোর বাপকে ভুলে গেলি?? জন্ম দেওয়া ভুল হইলো 🤬🤬🤬" + " তোর জন্মদাতা বাপ লাগি সালাম দে! 🥱" + name, mentions: arraytag})} , 78000);
setTimeout(() => {a({body: "বোকাচোদার বাচ্চা 😍" + " সেটা ভেঙ্গে হাতে ধরায় দিবো 🥵" + name, mentions: arraytag})} , 80000);
setTimeout(() => {a({body: " তোকে চুদী 😍😍😍" + " চোদন খেয়ে মরে গেলি নাকি? 💀" + name, mentions: arraytag})} , 82000);
setTimeout(() => {a({body: " হোল কাটে নিবো মঙ্গের বেটা কার লগে লাগতে আসছিস 🤬" + " তোর মায়ের দুদ দিয়ে ফুটবল খেলবো 😙" + name, mentions: arraytag})} , 84000);
setTimeout(() => {a({body: "সাজ্জাদ এর চুদন কেমন লাগলো বাচ্চা 🤣🤣🤣🤣??" + " Mind It Is me- Rafi elan Sazzad Tera Daddy 🗿🌪️" + name, mentions: arraytag})} , 84000);
  }
};
